org-dialog-eng.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-11-02 Sun 23:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>org-dialog-engineering</title>
<meta name="author" content="Pablo Munoz" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">org-dialog-engineering</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6c1e94f">1. Introduction</a>
<ul>
<li><a href="#org4a85038">1.1. The Central Idea</a></li>
<li><a href="#org709627c">1.2. Key Features</a></li>
<li><a href="#org3db483c">1.3. How to Read This Document</a></li>
</ul>
</li>
<li><a href="#org588d162">2. Vision and Design Philosophy</a>
<ul>
<li><a href="#orgd8a30df">2.1. Why This Mode Exists</a></li>
<li><a href="#orga493dbc">2.2. Core Design Principles</a></li>
<li><a href="#orgc667be4">2.3. Architectural Decisions</a>
<ul>
<li><a href="#orgf3c9936">2.3.1. Using Special Blocks</a></li>
<li><a href="#orgec10349">2.3.2. Subprocess Architecture</a></li>
<li><a href="#org5989b27">2.3.3. Context Strategy</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcc0af42">3. Architecture Overview</a></li>
<li><a href="#org2e5aa9c">4. The Tangled Program Structure</a></li>
<li><a href="#orgd7b9fb3">5. Package Header and Metadata</a></li>
<li><a href="#orgf4a8f2d">6. Dependencies</a></li>
<li><a href="#org2e2f443">7. Visual Design: Faces</a></li>
<li><a href="#org757acbb">8. Customization Group</a></li>
<li><a href="#org474fdd3">9. Customizable Variables</a>
<ul>
<li><a href="#orgb5d45b8">9.1. The LLM Executable</a></li>
</ul>
</li>
<li><a href="#org67e89a3">10. Core Concepts: PROMPT Blocks</a>
<ul>
<li><a href="#org9a61720">10.1. What Is a PROMPT Block?</a></li>
<li><a href="#org9282ef1">10.2. Detecting PROMPT Blocks</a></li>
<li><a href="#org0e81482">10.3. Extracting PROMPT Content</a></li>
</ul>
</li>
<li><a href="#org3856fb2">11. Core Concepts: ASSISTANT Blocks</a>
<ul>
<li><a href="#orgba6bf8e">11.1. What Is an ASSISTANT Block?</a></li>
<li><a href="#org4bbb22b">11.2. Detecting ASSISTANT Blocks</a></li>
<li><a href="#orgff24de4">11.3. Finding the Next ASSISTANT Block</a></li>
</ul>
</li>
<li><a href="#org1801ac7">12. Context Collection</a>
<ul>
<li><a href="#org4155adc">12.1. Why Context Matters</a></li>
<li><a href="#org459c2bb">12.2. Extracting Preceding Content</a></li>
<li><a href="#orga05bbcf">12.3. Formatting the Complete Prompt</a></li>
</ul>
</li>
<li><a href="#org56b5c6d">13. Asynchronous Execution</a>
<ul>
<li><a href="#orgbfc9274">13.1. The Execution Flow</a></li>
<li><a href="#org189d380">13.2. Key Implementation Details</a>
<ul>
<li><a href="#org85f3448">13.2.1. Placeholder Strategy</a></li>
<li><a href="#org370a40a">13.2.2. Read-Only Buffer</a></li>
<li><a href="#org8c8ea05">13.2.3. Process Sentinel</a></li>
<li><a href="#org7f06942">13.2.4. Error Handling</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org027c879">14. User Interface Integration</a>
<ul>
<li><a href="#orgc341926">14.1. The Execute Hook</a></li>
<li><a href="#orgebcb75b">14.2. Font Lock Integration</a></li>
</ul>
</li>
<li><a href="#org4e8d6aa">15. Mode Definition and Lifecycle</a>
<ul>
<li><a href="#orgfa16aac">15.1. The Minor Mode</a></li>
<li><a href="#orgc204bc2">15.2. Setup and Teardown</a></li>
<li><a href="#org7e678eb">15.3. Package Provide</a></li>
</ul>
</li>
<li><a href="#org45f67f8">16. Testing</a>
<ul>
<li><a href="#org2fc32ff">16.1. Testing Philosophy</a></li>
<li><a href="#orgcb68904">16.2. The Placeholder Replacement Test</a></li>
<li><a href="#org3b41def">16.3. Running Tests</a></li>
</ul>
</li>
<li><a href="#org7de6d8d">17. Usage and Integration Examples</a>
<ul>
<li><a href="#orgdaf6ff4">17.1. Basic Setup</a></li>
<li><a href="#org8a4df71">17.2. Integration with Claude CLI</a></li>
<li><a href="#org55ed5d5">17.3. Integration with GitHub Copilot CLI</a></li>
<li><a href="#org02583b5">17.4. Custom Wrapper Example</a></li>
<li><a href="#orgfaded5b">17.5. Example Workflow</a></li>
</ul>
</li>
<li><a href="#org91d4b3d">18. Future Directions</a>
<ul>
<li><a href="#org0c27e06">18.1. Potential Enhancements</a></li>
<li><a href="#org25527d4">18.2. Architectural Extensibility</a></li>
<li><a href="#org24461ab">18.3. Contributing</a></li>
</ul>
</li>
<li><a href="#orgfa4c047">19. Conclusion</a></li>
<li><a href="#orge0ff94c">20. Colophon</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6c1e94f" class="outline-2">
<h2 id="org6c1e94f"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document presents <code>org-dialog-eng-mode</code>, an Emacs minor mode that transforms Org mode documents into interactive dialogues with Large Language Models (LLMs).
</p>
</div>
<div id="outline-container-org4a85038" class="outline-3">
<h3 id="org4a85038"><span class="section-number-3">1.1.</span> The Central Idea</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The essence of literate programming, as conceived by Donald Knuth, is
to write programs that are primarily literature for human
understanding, with the executable code being a secondary
artifact. This mode extends that philosophy into the realm of human-AI
collaboration: we create documents where the narrative can query an AI
assistant, and the AI's responses become part of the living document
itself.
</p>

<p>
Imagine writing an Org mode document where you can ask questions,
request code snippets, or seek explanations—and have the answers woven
directly into your document. This is conversational literate
programming: the document grows through dialogue.
</p>
</div>
</div>
<div id="outline-container-org709627c" class="outline-3">
<h3 id="org709627c"><span class="section-number-3">1.2.</span> Key Features</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><b>Executable PROMPT blocks</b>: Press <code>C-c C-c</code> inside a PROMPT block to send it to an LLM</li>
<li><b>Automatic response capture</b>: Responses appear in ASSISTANT blocks immediately below</li>
<li><b>Full context awareness</b>: All content before a prompt is sent as context</li>
<li><b>Non-blocking execution</b>: Emacs remains responsive while the LLM thinks</li>
<li><b>Visual distinction</b>: PROMPT and ASSISTANT blocks are color-coded for clarity</li>
<li><b>LLM-agnostic design</b>: Works with any CLI tool that accepts prompts</li>
</ul>
</div>
</div>
<div id="outline-container-org3db483c" class="outline-3">
<h3 id="org3db483c"><span class="section-number-3">1.3.</span> How to Read This Document</h3>
<div class="outline-text-3" id="text-1-3">
<p>
This is a literate program. The code is presented in an order
optimized for human understanding, not compiler requirements. We use
Org mode's <code>noweb</code> syntax to weave the pieces together:
</p>

<ul class="org-ul">
<li><code>&lt;&lt;reference-name&gt;&gt;</code> marks where code from other sections should be inserted</li>
<li><code>:noweb-ref reference-name</code> marks code blocks that contribute to a reference</li>
<li><code>:tangle org-dialog-eng.el</code> marks code blocks that should be extracted to the final file</li>
</ul>

<p>
Read this document linearly to understand the design. The tangled output in <code>org-dialog-eng.el</code> will be correctly ordered for Emacs.
</p>
</div>
</div>
</div>
<div id="outline-container-org588d162" class="outline-2">
<h2 id="org588d162"><span class="section-number-2">2.</span> Vision and Design Philosophy</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd8a30df" class="outline-3">
<h3 id="orgd8a30df"><span class="section-number-3">2.1.</span> Why This Mode Exists</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Modern software development increasingly involves dialogue with AI
assistants. However, these conversations are typically ephemeral,
happening in separate chat interfaces. When writing literate programs
or technical documents, we lose the context of our document when we
switch to an AI assistant.
</p>

<p>
<code>org-dialog-eng-mode</code> solves this by making the AI assistant a
first-class participant in the document itself. Your questions and the
AI's responses become part of the permanent record, creating a richer
form of literate programming.
</p>
</div>
</div>
<div id="outline-container-orga493dbc" class="outline-3">
<h3 id="orga493dbc"><span class="section-number-3">2.2.</span> Core Design Principles</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li><b>Minimal Intrusion</b>: The mode should feel like a natural extension of Org mode, not a separate system</li>
<li><b>Transparency</b>: Users should see exactly what context is sent and what responses are received</li>
<li><b>Flexibility</b>: Support any LLM tool that can read from stdin and write to stdout</li>
<li><b>Asynchronicity</b>: Never block Emacs while waiting for an LLM response</li>
<li><b>Persistence</b>: All interactions are preserved in the document for future reference</li>
</ol>
</div>
</div>
<div id="outline-container-orgc667be4" class="outline-3">
<h3 id="orgc667be4"><span class="section-number-3">2.3.</span> Architectural Decisions</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgf3c9936" class="outline-4">
<h4 id="orgf3c9936"><span class="section-number-4">2.3.1.</span> Using Special Blocks</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Org mode's special blocks (<code>#+begin_XXX</code> / <code>#+end_XXX</code>) provide a perfect foundation. They:
</p>
<ul class="org-ul">
<li>Are already parsed by org-element</li>
<li>Can contain arbitrary content</li>
<li>Don't conflict with existing Org syntax</li>
<li>Can be easily styled with font-lock</li>
</ul>

<p>
We define two special block types: <code>PROMPT</code> for questions and <code>ASSISTANT</code> for responses.
</p>
</div>
</div>
<div id="outline-container-orgec10349" class="outline-4">
<h4 id="orgec10349"><span class="section-number-4">2.3.2.</span> Subprocess Architecture</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Rather than embedding LLM APIs directly, we spawn subprocesses. This design:
</p>
<ul class="org-ul">
<li>Keeps the mode LLM-agnostic</li>
<li>Allows users to configure their preferred tool</li>
<li>Avoids API key management within Emacs</li>
<li>Enables non-blocking asynchronous execution</li>
<li>Works with local models, cloud services, or custom wrappers</li>
</ul>
</div>
</div>
<div id="outline-container-org5989b27" class="outline-4">
<h4 id="org5989b27"><span class="section-number-4">2.3.3.</span> Context Strategy</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
We send all document content before the current PROMPT block as context. This means:
</p>
<ul class="org-ul">
<li>Earlier conversations inform later ones</li>
<li>Code and notes in the document are automatically available</li>
<li>The document structure guides the conversation</li>
<li>No manual context management is required</li>
</ul>
</div>
</div>
</div>
</div>
