org-dialog-eng.org
* Architecture Overview

The mode consists of several cooperating components:

#+begin_example
User presses C-c C-c in PROMPT block
            |
            v
    org-dialog-eng--execute-block (hook)
            |
            v
    Extract prompt content and preceding context
            |
            v
    Format into structured prompt with instructions
            |
            v
    Spawn async subprocess with LLM executable
            |
            v
    Insert placeholder ASSISTANT block immediately
            |
            v
    [User can continue working]
            |
            v
    Subprocess completes
            |
            v
    Sentinel function activates
            |
            v
    Replace placeholder with actual response
            |
            v
    Buffer becomes writable again
#+end_example

This architecture ensures Emacs never blocks, and users receive immediate feedback (the placeholder) followed by the actual response when ready.

* The Tangled Program Structure

The final Emacs Lisp file is assembled from several conceptual
sections. Here's the overall structure:

#+begin_src emacs-lisp :tangle org-dialog-eng.el :noweb yes
;;; org-dialog-eng.el --- LLM integration for Org mode -*- lexical-binding: t; -*-

<<package-header>>

<<dependencies>>

<<custom-group>>

<<faces>>

<<custom-variables>>

<<element-predicates>>

<<content-extraction>>

<<context-collection>>

<<execution>>

<<mode-definition>>

<<provide>>

;;; org-dialog-eng.el ends here
#+end_src

Each =<<section>>= will be defined in the sections that follow.

