org-dialog-eng.html
<div id="outline-container-orgcc0af42" class="outline-2">
<h2 id="orgcc0af42"><span class="section-number-2">3.</span> Architecture Overview</h2>
<div class="outline-text-2" id="text-3">
<p>
The mode consists of several cooperating components:
</p>

<pre class="example" id="org83a7674">
User presses C-c C-c in PROMPT block
            |
            v
    org-dialog-eng--execute-block (hook)
            |
            v
    Extract prompt content and preceding context
            |
            v
    Format into structured prompt with instructions
            |
            v
    Spawn async subprocess with LLM executable
            |
            v
    Insert placeholder ASSISTANT block immediately
            |
            v
    [User can continue working]
            |
            v
    Subprocess completes
            |
            v
    Sentinel function activates
            |
            v
    Replace placeholder with actual response
            |
            v
    Buffer becomes writable again
</pre>

<p>
This architecture ensures Emacs never blocks, and users receive immediate feedback (the placeholder) followed by the actual response when ready.
</p>
</div>
</div>
<div id="outline-container-org2e5aa9c" class="outline-2">
<h2 id="org2e5aa9c"><span class="section-number-2">4.</span> The Tangled Program Structure</h2>
<div class="outline-text-2" id="text-4">
<p>
The final Emacs Lisp file is assembled from several conceptual
sections. Here's the overall structure:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;;; org-dialog-eng.el --- LLM integration for Org mode -*- lexical-binding: t; -*-
