org-dialog-eng.org
* Package Header and Metadata

Every well-formed Emacs package begins with proper metadata. This
section defines the package header with copyright information,
requirements, and basic documentation.

#+begin_src emacs-lisp :noweb-ref package-header
;; Copyright (C) 2025 Pablo Munoz

;; Author: Pablo Munoz
;; Version: 0.3.0
;; Package-Requires: ((emacs "27.1") (org "9.0"))
;; Keywords: org, ai, llm, literate-programming
;; URL: https://github.com/pmunoz/org-dialog-eng

;;; Commentary:

;; This package enables interactive dialogues with Large Language Models
;; directly within Org mode documents.  It extends the literate programming
;; paradigm to include AI-assisted document development.
;;
;; Usage:
;;   1. Enable org-dialog-eng-mode in an Org buffer
;;   2. Create a #+begin_prompt block with your question
;;   3. Position cursor inside the block and press C-c C-c
;;   4. An ASSISTANT block with the response appears below
;;
;; The mode sends all document content before the prompt as context,
;; enabling context-aware conversations that reference your notes and code.
;;
;; Configuration:
;;   (require 'org-dialog-eng)
;;   (add-hook 'org-mode-hook #'org-dialog-eng-mode)
;;   (setq org-dialog-eng-executable "claude")  ; or your preferred LLM CLI

;;; Code:
#+end_src

