org-dialog-eng.org
* Dependencies

We rely on Org mode's powerful parsing capabilities to understand
document structure.

#+begin_src emacs-lisp :noweb-ref dependencies
(require 'org)
(require 'org-element)
#+end_src

The =org-element= library provides the abstract syntax tree parsing
that lets us identify special blocks and extract their properties
reliably.

* Visual Design: Faces

Visual distinction helps users immediately recognize PROMPT and
ASSISTANT blocks. We define custom faces with subtle background
colors.

#+begin_src emacs-lisp :noweb-ref faces
(defface org-dialog-eng-prompt-block
  '((t (:background "#2d3a55" :extend t)))
  "Face for PROMPT block content.
The background provides visual distinction for user-authored prompts."
  :group 'org-dialog-eng)

(defface org-dialog-eng-assistant-block
  '((t (:background "#3d2f5b" :extend t)))
  "Face for ASSISTANT block content.
A slightly different hue distinguishes LLM responses from user prompts."
  :group 'org-dialog-eng)
#+end_src

The =:extend t= property ensures the background color extends to the
full window width, creating clear visual boundaries even in wide
windows.

* Customization Group

We define a customization group so users can find all related settings via =M-x customize-group RET org-dialog-eng=.

#+begin_src emacs-lisp :noweb-ref custom-group
(defgroup org-dialog-eng nil
  "LLM integration for Org mode documents."
  :group 'org
  :prefix "org-dialog-eng-")
#+end_src

* Customizable Variables

** The LLM Executable

The most important customization: which LLM tool to use.

#+begin_src emacs-lisp :noweb-ref custom-variables
(defcustom org-dialog-eng-executable "claude"
  "Executable for LLM interaction.
This should be a command-line tool that accepts a prompt via the -p flag
and outputs the response to stdout. Examples: \"claude\", \"copilot\",
or a custom wrapper script."
  :type 'string
  :group 'org-dialog-eng)
#+end_src

*Design Decision*: We use a string rather than a function,
prioritizing simplicity. Users who need complex behavior can write a
shell script wrapper.

* Core Concepts: PROMPT Blocks

** What Is a PROMPT Block?

A PROMPT block is an Org special block containing a question or
request for the LLM:

#+begin_example
#+begin_prompt
Write a Python function to compute the Fibonacci sequence.
#+end_prompt
#+end_example

When executed with =C-c C-c=, the content is sent to the configured
LLM executable.

** Detecting PROMPT Blocks

We need a predicate to identify whether a given org-element is a PROMPT block.

#+begin_src emacs-lisp :noweb-ref element-predicates
(defun org-dialog-eng--element-is-prompt-block-p (element)
  "Return non-nil if ELEMENT is a PROMPT block.
ELEMENT should be an org-element as returned by `org-element-at-point'."
  (and (eq (org-element-type element) 'special-block)
       (string-equal (upcase (org-element-property :type element)) "PROMPT")))
#+end_src

*Implementation Note*: We use =string-equal= with =upcase= because Org mode normalizes block names to uppercase internally, but user input may be mixed case.

** Extracting PROMPT Content

Once we've identified a PROMPT block, we need its textual content (excluding the begin/end markers).

#+begin_src emacs-lisp :noweb-ref content-extraction
(defun org-dialog-eng--extract-block-content (element)
  "Extract the content from special block ELEMENT.
Returns the text between #+begin_XXX and #+end_XXX as a string,
with leading and trailing whitespace trimmed."
  (let* ((begin (org-element-property :contents-begin element))
         (end (org-element-property :contents-end element)))
    (when (and begin end)
      (string-trim (buffer-substring-no-properties begin end)))))
#+end_src

The =:contents-begin= and =:contents-end= properties provided by org-element give us precisely the content boundaries, making this function trivial yet reliable.

* Core Concepts: ASSISTANT Blocks

** What Is an ASSISTANT Block?

An ASSISTANT block contains the LLM's response:

#+begin_example
#+begin_assistant
Here's a Python implementation:

def fibonacci(n):
    if n <= 1:
        return n
    return fibonacci(n-1) + fibonacci(n-2)
#+end_assistant
#+end_example

These blocks are created automatically when a PROMPT is executed.

** Detecting ASSISTANT Blocks

Similar to PROMPT blocks, we need a predicate:

#+begin_src emacs-lisp :noweb-ref element-predicates
(defun org-dialog-eng--element-is-assistant-block-p (element)
  "Return non-nil if ELEMENT is an ASSISTANT block."
  (and (eq (org-element-type element) 'special-block)
       (string-equal (upcase (org-element-property :type element)) "ASSISTANT")))
#+end_src

