org-dialog-eng.html
<div id="outline-container-orgf4a8f2d" class="outline-2">
<h2 id="orgf4a8f2d"><span class="section-number-2">6.</span> Dependencies</h2>
<div class="outline-text-2" id="text-6">
<p>
We rely on Org mode's powerful parsing capabilities to understand
document structure.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'org)
(require 'org-element)
</pre>
</div>

<p>
The <code>org-element</code> library provides the abstract syntax tree parsing
that lets us identify special blocks and extract their properties
reliably.
</p>
</div>
</div>
<div id="outline-container-org2e2f443" class="outline-2">
<h2 id="org2e2f443"><span class="section-number-2">7.</span> Visual Design: Faces</h2>
<div class="outline-text-2" id="text-7">
<p>
Visual distinction helps users immediately recognize PROMPT and
ASSISTANT blocks. We define custom faces with subtle background
colors.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defface org-dialog-eng-prompt-block
  '((t (:background "#2d3a55" :extend t)))
  "Face for PROMPT block content.
The background provides visual distinction for user-authored prompts."
  :group 'org-dialog-eng)

(defface org-dialog-eng-assistant-block
  '((t (:background "#3d2f5b" :extend t)))
  "Face for ASSISTANT block content.
A slightly different hue distinguishes LLM responses from user prompts."
  :group 'org-dialog-eng)
</pre>
</div>

<p>
The <code>:extend t</code> property ensures the background color extends to the
full window width, creating clear visual boundaries even in wide
windows.
</p>
</div>
</div>
<div id="outline-container-org757acbb" class="outline-2">
<h2 id="org757acbb"><span class="section-number-2">8.</span> Customization Group</h2>
<div class="outline-text-2" id="text-8">
<p>
We define a customization group so users can find all related settings via <code>M-x customize-group RET org-dialog-eng</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defgroup org-dialog-eng nil
  "LLM integration for Org mode documents."
  :group 'org
  :prefix "org-dialog-eng-")
</pre>
</div>
</div>
</div>
<div id="outline-container-org474fdd3" class="outline-2">
<h2 id="org474fdd3"><span class="section-number-2">9.</span> Customizable Variables</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgb5d45b8" class="outline-3">
<h3 id="orgb5d45b8"><span class="section-number-3">9.1.</span> The LLM Executable</h3>
<div class="outline-text-3" id="text-9-1">
<p>
The most important customization: which LLM tool to use.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom org-dialog-eng-executable "claude"
  "Executable for LLM interaction.
This should be a command-line tool that accepts a prompt via the -p flag
and outputs the response to stdout. Examples: \"claude\", \"copilot\",
or a custom wrapper script."
  :type 'string
  :group 'org-dialog-eng)
</pre>
</div>

<p>
<b>Design Decision</b>: We use a string rather than a function,
prioritizing simplicity. Users who need complex behavior can write a
shell script wrapper.
</p>
</div>
</div>
</div>
<div id="outline-container-org67e89a3" class="outline-2">
<h2 id="org67e89a3"><span class="section-number-2">10.</span> Core Concepts: PROMPT Blocks</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org9a61720" class="outline-3">
<h3 id="org9a61720"><span class="section-number-3">10.1.</span> What Is a PROMPT Block?</h3>
<div class="outline-text-3" id="text-10-1">
<p>
A PROMPT block is an Org special block containing a question or
request for the LLM:
</p>

<pre class="example" id="orgf4471e2">
#+begin_prompt
Write a Python function to compute the Fibonacci sequence.
#+end_prompt
</pre>

<p>
When executed with <code>C-c C-c</code>, the content is sent to the configured
LLM executable.
</p>
</div>
</div>
<div id="outline-container-org9282ef1" class="outline-3">
<h3 id="org9282ef1"><span class="section-number-3">10.2.</span> Detecting PROMPT Blocks</h3>
<div class="outline-text-3" id="text-10-2">
<p>
We need a predicate to identify whether a given org-element is a PROMPT block.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun org-dialog-eng--element-is-prompt-block-p (element)
  "Return non-nil if ELEMENT is a PROMPT block.
ELEMENT should be an org-element as returned by `org-element-at-point'."
  (and (eq (org-element-type element) 'special-block)
       (string-equal (upcase (org-element-property :type element)) "PROMPT")))
</pre>
</div>

<p>
<b>Implementation Note</b>: We use <code>string-equal</code> with <code>upcase</code> because Org mode normalizes block names to uppercase internally, but user input may be mixed case.
</p>
</div>
</div>
<div id="outline-container-org0e81482" class="outline-3">
<h3 id="org0e81482"><span class="section-number-3">10.3.</span> Extracting PROMPT Content</h3>
<div class="outline-text-3" id="text-10-3">
<p>
Once we've identified a PROMPT block, we need its textual content (excluding the begin/end markers).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun org-dialog-eng--extract-block-content (element)
  "Extract the content from special block ELEMENT.
Returns the text between #+begin_XXX and #+end_XXX as a string,
with leading and trailing whitespace trimmed."
  (let* ((begin (org-element-property :contents-begin element))
         (end (org-element-property :contents-end element)))
    (when (and begin end)
      (string-trim (buffer-substring-no-properties begin end)))))
</pre>
</div>

<p>
The <code>:contents-begin</code> and <code>:contents-end</code> properties provided by org-element give us precisely the content boundaries, making this function trivial yet reliable.
</p>
</div>
</div>
</div>
<div id="outline-container-org3856fb2" class="outline-2">
<h2 id="org3856fb2"><span class="section-number-2">11.</span> Core Concepts: ASSISTANT Blocks</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgba6bf8e" class="outline-3">
<h3 id="orgba6bf8e"><span class="section-number-3">11.1.</span> What Is an ASSISTANT Block?</h3>
<div class="outline-text-3" id="text-11-1">
<p>
An ASSISTANT block contains the LLM's response:
</p>

<pre class="example" id="org237f9b1">
#+begin_assistant
Here's a Python implementation:

def fibonacci(n):
    if n &lt;= 1:
        return n
    return fibonacci(n-1) + fibonacci(n-2)
#+end_assistant
</pre>

<p>
These blocks are created automatically when a PROMPT is executed.
</p>
</div>
</div>
<div id="outline-container-org4bbb22b" class="outline-3">
<h3 id="org4bbb22b"><span class="section-number-3">11.2.</span> Detecting ASSISTANT Blocks</h3>
<div class="outline-text-3" id="text-11-2">
<p>
Similar to PROMPT blocks, we need a predicate:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun org-dialog-eng--element-is-assistant-block-p (element)
  "Return non-nil if ELEMENT is an ASSISTANT block."
  (and (eq (org-element-type element) 'special-block)
       (string-equal (upcase (org-element-property :type element)) "ASSISTANT")))
</pre>
</div>
</div>
</div>
