org-dialog-eng.el
(require 'org-element)

(defgroup org-dialog-eng nil
  "LLM integration for Org mode documents."
  :group 'org
  :prefix "org-dialog-eng-")

(defface org-dialog-eng-prompt-block
  '((t (:background "#2d3a55" :extend t)))
  "Face for PROMPT block content.
The background provides visual distinction for user-authored prompts."
  :group 'org-dialog-eng)

(defface org-dialog-eng-assistant-block
  '((t (:background "#3d2f5b" :extend t)))
  "Face for ASSISTANT block content.
A slightly different hue distinguishes LLM responses from user prompts."
  :group 'org-dialog-eng)

(defcustom org-dialog-eng-executable "claude"
  "Executable for LLM interaction.
This should be a command-line tool that accepts a prompt via the -p flag
and outputs the response to stdout. Examples: \"claude\", \"copilot\",
or a custom wrapper script."
  :type 'string
  :group 'org-dialog-eng)

(defun org-dialog-eng--element-is-prompt-block-p (element)
  "Return non-nil if ELEMENT is a PROMPT block.
ELEMENT should be an org-element as returned by `org-element-at-point'."
  (and (eq (org-element-type element) 'special-block)
       (string-equal (upcase (org-element-property :type element)) "PROMPT")))
(defun org-dialog-eng--element-is-assistant-block-p (element)
  "Return non-nil if ELEMENT is an ASSISTANT block."
  (and (eq (org-element-type element) 'special-block)
       (string-equal (upcase (org-element-property :type element)) "ASSISTANT")))

(defun org-dialog-eng--extract-block-content (element)
  "Extract the content from special block ELEMENT.
Returns the text between #+begin_XXX and #+end_XXX as a string,
with leading and trailing whitespace trimmed."
  (let* ((begin (org-element-property :contents-begin element))
         (end (org-element-property :contents-end element)))
    (when (and begin end)
      (string-trim (buffer-substring-no-properties begin end)))))
