org-dialog-eng.org
** Finding the Next ASSISTANT Block

When a PROMPT is executed, we check if an ASSISTANT block immediately follows. If so, we replace it (allowing re-execution of prompts). If not, we insert a new one.

#+begin_src emacs-lisp :noweb-ref content-extraction
(defun org-dialog-eng--find-next-assistant-block (prompt-element)
  "Find the ASSISTANT block immediately following PROMPT-ELEMENT.
Returns the element if found, nil otherwise.
Skips whitespace between the blocks."
  (save-excursion
    (goto-char (org-element-property :end prompt-element))
    ;; Skip any whitespace or blank lines
    (skip-chars-forward " \t\n")
    ;; Check if we're now at an ASSISTANT block
    (let ((next-elem (org-element-at-point)))
      (when (org-dialog-eng--element-is-assistant-block-p next-elem)
        next-elem))))
#+end_src

*Design Decision*: We use =skip-chars-forward= to handle arbitrary
whitespace rather than a fixed number of lines. This makes the system
robust to different user formatting styles.

* Context Collection

** Why Context Matters

LLMs are more useful when they understand what you're working on. By sending all document content before the current PROMPT, we ensure the LLM has full context about:
- Previous questions and answers
- Code examples in the document
- Notes and documentation
- The overall structure of your work

** Extracting Preceding Content

#+begin_src emacs-lisp :noweb-ref context-collection
(defun org-dialog-eng--get-preceding-context ()
  "Extract all buffer content before the current PROMPT block.
Returns a string containing everything from the buffer start
up to (but not including) the current PROMPT block."
  (let* ((element (org-element-at-point))
         (block (org-element-lineage element '(special-block) t))
         (prompt-begin (org-element-property :begin block)))
    (when prompt-begin
      (string-trim
       (buffer-substring-no-properties (point-min) prompt-begin)))))
#+end_src

The =org-element-lineage= function walks up the element tree to find
the containing special-block, even if point is on a line of content
within the block rather than the begin/end markers.

** Formatting the Complete Prompt

We wrap the user's prompt and the context in a structured format with
instructions:

#+begin_src emacs-lisp :noweb-ref context-collection
(defun org-dialog-eng--format-prompt (prompt-content context)
  "Format PROMPT-CONTENT and CONTEXT into a structured prompt.
Returns a string suitable for sending to the LLM executable."
  (format "
<instructions>
You are a helpful assistant helping write an Org mode document in Emacs,
potentially including code (literate programming style). I will provide
a prompt, and you should respond concisely.

If the prompt requests code, provide it in Org syntax (#+begin_src blocks),
not markdown. If it requests modifications, show only the changes needed.

I will also provide context: the content of the Org file we have written
so far, for better-informed responses.

When you see #+begin_prompt ... #+end_prompt delimiters, the content
inside is a prompt I gave you previously.

When you see #+begin_assistant ... #+end_assistant delimiters, the
content inside is a response you gave me previously.

CRITICAL: Since we are editing an Org file together, use Org syntax,
NOT markdown, unless explicitly requested otherwise.
</instructions>

<prompt>
%s
</prompt>

<context>
%s
</context>
" prompt-content context))
#+end_src

*Design Decision*: We use XML-style tags (=<instructions>=, =<prompt>=, =<context>=) rather than natural language markers. This creates clear boundaries that LLMs parse reliably.

* Asynchronous Execution

