org-dialog-eng.html
<div id="outline-container-orgff24de4" class="outline-3">
<h3 id="orgff24de4"><span class="section-number-3">11.3.</span> Finding the Next ASSISTANT Block</h3>
<div class="outline-text-3" id="text-11-3">
<p>
When a PROMPT is executed, we check if an ASSISTANT block immediately follows. If so, we replace it (allowing re-execution of prompts). If not, we insert a new one.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun org-dialog-eng--find-next-assistant-block (prompt-element)
  "Find the ASSISTANT block immediately following PROMPT-ELEMENT.
Returns the element if found, nil otherwise.
Skips whitespace between the blocks."
  (save-excursion
    (goto-char (org-element-property :end prompt-element))
    ;; Skip any whitespace or blank lines
    (skip-chars-forward " \t\n")
    ;; Check if we're now at an ASSISTANT block
    (let ((next-elem (org-element-at-point)))
      (when (org-dialog-eng--element-is-assistant-block-p next-elem)
        next-elem))))
</pre>
</div>

<p>
<b>Design Decision</b>: We use <code>skip-chars-forward</code> to handle arbitrary
whitespace rather than a fixed number of lines. This makes the system
robust to different user formatting styles.
</p>
</div>
</div>
</div>
<div id="outline-container-org1801ac7" class="outline-2">
<h2 id="org1801ac7"><span class="section-number-2">12.</span> Context Collection</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org4155adc" class="outline-3">
<h3 id="org4155adc"><span class="section-number-3">12.1.</span> Why Context Matters</h3>
<div class="outline-text-3" id="text-12-1">
<p>
LLMs are more useful when they understand what you're working on. By sending all document content before the current PROMPT, we ensure the LLM has full context about:
</p>
<ul class="org-ul">
<li>Previous questions and answers</li>
<li>Code examples in the document</li>
<li>Notes and documentation</li>
<li>The overall structure of your work</li>
</ul>
</div>
</div>
<div id="outline-container-org459c2bb" class="outline-3">
<h3 id="org459c2bb"><span class="section-number-3">12.2.</span> Extracting Preceding Content</h3>
<div class="outline-text-3" id="text-12-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun org-dialog-eng--get-preceding-context ()
  "Extract all buffer content before the current PROMPT block.
Returns a string containing everything from the buffer start
up to (but not including) the current PROMPT block."
  (let* ((element (org-element-at-point))
         (block (org-element-lineage element '(special-block) t))
         (prompt-begin (org-element-property :begin block)))
    (when prompt-begin
      (string-trim
       (buffer-substring-no-properties (point-min) prompt-begin)))))
</pre>
</div>

<p>
The <code>org-element-lineage</code> function walks up the element tree to find
the containing special-block, even if point is on a line of content
within the block rather than the begin/end markers.
</p>
</div>
</div>
<div id="outline-container-orga05bbcf" class="outline-3">
<h3 id="orga05bbcf"><span class="section-number-3">12.3.</span> Formatting the Complete Prompt</h3>
<div class="outline-text-3" id="text-12-3">
<p>
We wrap the user's prompt and the context in a structured format with
instructions:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun org-dialog-eng--format-prompt (prompt-content context)
  "Format PROMPT-CONTENT and CONTEXT into a structured prompt.
Returns a string suitable for sending to the LLM executable."
  (format "
&lt;instructions&gt;
You are a helpful assistant helping write an Org mode document in Emacs,
potentially including code (literate programming style). I will provide
a prompt, and you should respond concisely.

If the prompt requests code, provide it in Org syntax (#+begin_src blocks),
not markdown. If it requests modifications, show only the changes needed.

I will also provide context: the content of the Org file we have written
so far, for better-informed responses.

When you see #+begin_prompt ... #+end_prompt delimiters, the content
inside is a prompt I gave you previously.

When you see #+begin_assistant ... #+end_assistant delimiters, the
content inside is a response you gave me previously.

CRITICAL: Since we are editing an Org file together, use Org syntax,
NOT markdown, unless explicitly requested otherwise.
&lt;/instructions&gt;

&lt;prompt&gt;
%s
&lt;/prompt&gt;

&lt;context&gt;
%s
&lt;/context&gt;
" prompt-content context))
</pre>
</div>

<p>
<b>Design Decision</b>: We use XML-style tags (<code>&lt;instructions&gt;</code>, <code>&lt;prompt&gt;</code>, <code>&lt;context&gt;</code>) rather than natural language markers. This creates clear boundaries that LLMs parse reliably.
</p>
</div>
</div>
</div>
