org-dialog-eng.org
** The Execution Flow

This is the heart of the mode: executing a PROMPT block and capturing the response.

#+begin_src emacs-lisp :noweb-ref execution
(defun org-dialog-eng--execute-prompt-block ()
  "Execute the PROMPT block at point.
Spawns an async LLM subprocess and inserts the response in an ASSISTANT block.
The buffer becomes read-only during execution to prevent concurrent edits."
  (interactive)
  (let* ((element (org-element-at-point))
         (prompt-content (org-dialog-eng--extract-block-content element))
         (preceding-context (org-dialog-eng--get-preceding-context))
         (formatted-prompt (org-dialog-eng--format-prompt prompt-content preceding-context)))

    (unless prompt-content
      (error "No prompt content found. Ensure cursor is inside a PROMPT block"))

    (let* ((block-end (org-element-property :end element))
           (output-buffer (generate-new-buffer " *llm-output*"))
           (source-buffer (current-buffer)))

      ;; Immediately insert a placeholder ASSISTANT block for feedback
      (save-excursion
        (goto-char block-end)
        (unless (looking-at-p "^[ \t]*$")
          (end-of-line)
          (insert "\n"))
        (insert "\n#+begin_assistant\nLLM is working...\n#+end_assistant\n"))

      ;; Make buffer read-only to prevent concurrent edits
      (setq buffer-read-only t)
      (message "Querying LLM...")

      ;; Spawn the async process
      (make-process
       :name "org-dialog-eng-process"
       :buffer output-buffer
       :command (list org-dialog-eng-executable "-p" formatted-prompt)
       :sentinel
       (lambda (process event)
         (when (string-match-p "finished" event)
           (if (buffer-live-p source-buffer)
               (with-current-buffer source-buffer
                 (let ((response (with-current-buffer output-buffer
                                   (buffer-substring-no-properties
                                    (point-min) (point-max)))))
                   (save-excursion
                     ;; Make buffer temporarily writable
                     (setq buffer-read-only nil)

                     ;; Find and remove any existing ASSISTANT block
                     (let ((next-assistant
                            (org-dialog-eng--find-next-assistant-block element)))
                       (when next-assistant
                         (delete-region
                          (org-element-property :begin next-assistant)
                          (org-element-property :end next-assistant))))

                     ;; Insert the new ASSISTANT block with actual response
                     (goto-char block-end)
                     (unless (looking-at-p "^[ \t]*$")
                       (end-of-line)
                       (insert "\n"))
                     (insert "\n#+begin_assistant\n")
                     (insert (string-trim response))
                     (insert "\n#+end_assistant\n"))

                   ;; Restore read-only status
                   (setq buffer-read-only nil)
                   (message "LLM response inserted")))
             (message "Source buffer no longer exists"))

           ;; Clean up output buffer
           (when (buffer-live-p output-buffer)
             (kill-buffer output-buffer))))

       :stderr (get-buffer-create "*org-dialog-eng-errors*")))))
#+end_src

** Key Implementation Details

*** Placeholder Strategy

We insert a placeholder ASSISTANT block immediately, before the
subprocess starts. This provides instant feedback to the user, showing
that their action was recognized.

*** Read-Only Buffer

While the LLM is thinking, we make the buffer read-only. This prevents
users from editing content that might confuse the position tracking
when we insert the response.

*Alternative Considered*: We could use markers instead of positions,
which would allow concurrent editing. However, this adds complexity
and could lead to confusing insertion points if users edit near the
PROMPT block during execution.

*** Process Sentinel

The sentinel function is called when the subprocess completes. We:
1. Check if the source buffer still exists (user might have killed it)
2. Extract the response from the output buffer
3. Find and delete any placeholder ASSISTANT block
4. Insert the actual response
5. Clean up temporary buffers

*** Error Handling

stderr is redirected to a dedicated buffer (=*org-dialog-eng-errors*=)
so users can debug LLM tool issues without cluttering the main buffer.

* User Interface Integration

