org-dialog-eng.html
<div id="outline-container-org56b5c6d" class="outline-2">
<h2 id="org56b5c6d"><span class="section-number-2">13.</span> Asynchronous Execution</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgbfc9274" class="outline-3">
<h3 id="orgbfc9274"><span class="section-number-3">13.1.</span> The Execution Flow</h3>
<div class="outline-text-3" id="text-13-1">
<p>
This is the heart of the mode: executing a PROMPT block and capturing the response.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun org-dialog-eng--execute-prompt-block ()
  "Execute the PROMPT block at point.
Spawns an async LLM subprocess and inserts the response in an ASSISTANT block.
The buffer becomes read-only during execution to prevent concurrent edits."
  (interactive)
  (let* ((element (org-element-at-point))
         (prompt-content (org-dialog-eng--extract-block-content element))
         (preceding-context (org-dialog-eng--get-preceding-context))
         (formatted-prompt (org-dialog-eng--format-prompt prompt-content preceding-context)))

    (unless prompt-content
      (error "No prompt content found. Ensure cursor is inside a PROMPT block"))

    (let* ((block-end (org-element-property :end element))
           (output-buffer (generate-new-buffer " *llm-output*"))
           (source-buffer (current-buffer)))

      ;; Immediately insert a placeholder ASSISTANT block for feedback
      (save-excursion
        (goto-char block-end)
        (unless (looking-at-p "^[ \t]*$")
          (end-of-line)
          (insert "\n"))
        (insert "\n#+begin_assistant\nLLM is working...\n#+end_assistant\n"))

      ;; Make buffer read-only to prevent concurrent edits
      (setq buffer-read-only t)
      (message "Querying LLM...")

      ;; Spawn the async process
      (make-process
       :name "org-dialog-eng-process"
       :buffer output-buffer
       :command (list org-dialog-eng-executable "-p" formatted-prompt)
       :sentinel
       (lambda (process event)
         (when (string-match-p "finished" event)
           (if (buffer-live-p source-buffer)
               (with-current-buffer source-buffer
                 (let ((response (with-current-buffer output-buffer
                                   (buffer-substring-no-properties
                                    (point-min) (point-max)))))
                   (save-excursion
                     ;; Make buffer temporarily writable
                     (setq buffer-read-only nil)

                     ;; Find and remove any existing ASSISTANT block
                     (let ((next-assistant
                            (org-dialog-eng--find-next-assistant-block element)))
                       (when next-assistant
                         (delete-region
                          (org-element-property :begin next-assistant)
                          (org-element-property :end next-assistant))))

                     ;; Insert the new ASSISTANT block with actual response
                     (goto-char block-end)
                     (unless (looking-at-p "^[ \t]*$")
                       (end-of-line)
                       (insert "\n"))
                     (insert "\n#+begin_assistant\n")
                     (insert (string-trim response))
                     (insert "\n#+end_assistant\n"))

                   ;; Restore read-only status
                   (setq buffer-read-only nil)
                   (message "LLM response inserted")))
             (message "Source buffer no longer exists"))

           ;; Clean up output buffer
           (when (buffer-live-p output-buffer)
             (kill-buffer output-buffer))))

       :stderr (get-buffer-create "*org-dialog-eng-errors*")))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org189d380" class="outline-3">
<h3 id="org189d380"><span class="section-number-3">13.2.</span> Key Implementation Details</h3>
<div class="outline-text-3" id="text-13-2">
</div>
<div id="outline-container-org85f3448" class="outline-4">
<h4 id="org85f3448"><span class="section-number-4">13.2.1.</span> Placeholder Strategy</h4>
<div class="outline-text-4" id="text-13-2-1">
<p>
We insert a placeholder ASSISTANT block immediately, before the
subprocess starts. This provides instant feedback to the user, showing
that their action was recognized.
</p>
</div>
</div>
<div id="outline-container-org370a40a" class="outline-4">
<h4 id="org370a40a"><span class="section-number-4">13.2.2.</span> Read-Only Buffer</h4>
<div class="outline-text-4" id="text-13-2-2">
<p>
While the LLM is thinking, we make the buffer read-only. This prevents
users from editing content that might confuse the position tracking
when we insert the response.
</p>

<p>
<b>Alternative Considered</b>: We could use markers instead of positions,
which would allow concurrent editing. However, this adds complexity
and could lead to confusing insertion points if users edit near the
PROMPT block during execution.
</p>
</div>
</div>
<div id="outline-container-org8c8ea05" class="outline-4">
<h4 id="org8c8ea05"><span class="section-number-4">13.2.3.</span> Process Sentinel</h4>
<div class="outline-text-4" id="text-13-2-3">
<p>
The sentinel function is called when the subprocess completes. We:
</p>
<ol class="org-ol">
<li>Check if the source buffer still exists (user might have killed it)</li>
<li>Extract the response from the output buffer</li>
<li>Find and delete any placeholder ASSISTANT block</li>
<li>Insert the actual response</li>
<li>Clean up temporary buffers</li>
</ol>
</div>
</div>
<div id="outline-container-org7f06942" class="outline-4">
<h4 id="org7f06942"><span class="section-number-4">13.2.4.</span> Error Handling</h4>
<div class="outline-text-4" id="text-13-2-4">
<p>
stderr is redirected to a dedicated buffer (<code>*org-dialog-eng-errors*</code>)
so users can debug LLM tool issues without cluttering the main buffer.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org027c879" class="outline-2">
<h2 id="org027c879"><span class="section-number-2">14.</span> User Interface Integration</h2>
<div class="outline-text-2" id="text-14">
</div>
