org-dialog-eng.org
** The Execute Hook

Users expect =C-c C-c= in Org mode to "do something appropriate" with
the element at point. We hook into Org's existing mechanism:

#+begin_src emacs-lisp :noweb-ref execution
(defun org-dialog-eng--execute-block ()
  "Hook function for `org-ctrl-c-ctrl-c-hook'.
Executes PROMPT blocks when point is inside one.
Returns non-nil if the block was executed, nil otherwise."
  (let* ((element (org-element-at-point))
         (block (org-element-lineage element '(special-block) t)))
    (when (and block (org-dialog-eng--element-is-prompt-block-p block))
      (org-dialog-eng--execute-prompt-block)
      t)))  ; Return t to stop hook processing
#+end_src

By returning =t= when we handle the block, we prevent other
=org-ctrl-c-ctrl-c-hook= functions from running, avoiding conflicts.

** Font Lock Integration

We register our custom faces with Emacs' font-lock system so blocks
are colored appropriately:

#+begin_src emacs-lisp :noweb-ref mode-definition
(defun org-dialog-eng--fontify-block (limit)
  "Fontify PROMPT and ASSISTANT blocks up to LIMIT.
This is a font-lock matcher function that properly handles multiline blocks."
  (let ((case-fold-search t))
    (when (re-search-forward
           "^[ \t]*#\\+begin_\\(prompt\\|assistant\\)\\>"
           limit t)
      (let* ((block-type (match-string 1))
             (face (if (string-equal (downcase block-type) "prompt")
                       'org-dialog-eng-prompt-block
                     'org-dialog-eng-assistant-block))
             (beg (match-beginning 0))
             (end-re (format "^[ \t]*#\\+end_%s\\>" block-type)))
        (when (re-search-forward end-re limit t)
          (let ((end (match-end 0)))
            (put-text-property beg end 'face face)
            (put-text-property beg end 'font-lock-multiline t)
            (goto-char end)
            t))))))

(defun org-dialog-eng--setup-font-lock ()
  "Add font-lock keywords for PROMPT and ASSISTANT blocks."
  ;; Use a function-based matcher for reliable multiline matching
  (font-lock-add-keywords nil
    '((org-dialog-eng--fontify-block))
    'append)
  ;; Enable multiline font-lock
  (setq-local font-lock-multiline t))

(defun org-dialog-eng--teardown-font-lock ()
  "Remove font-lock keywords for PROMPT and ASSISTANT blocks."
  (font-lock-remove-keywords nil
    '((org-dialog-eng--fontify-block))))
#+end_src

*Implementation Note*: Instead of using complex multiline regexes
(which have limitations in Emacs font-lock), we use a **function-based
font-lock matcher**. The =org-dialog-eng--fontify-block= function
searches for begin markers, finds the corresponding end marker, and
applies the face to the entire region. This approach is more reliable
for multiline blocks and properly sets the =font-lock-multiline=
property to ensure refontification when blocks are edited.

* Mode Definition and Lifecycle

** The Minor Mode

#+begin_src emacs-lisp :noweb-ref mode-definition
;;;###autoload
(define-minor-mode org-dialog-eng-mode
  "Minor mode for LLM integration in Org mode documents.

This mode enables interactive dialogues with Large Language Models
directly within your Org documents. Create PROMPT blocks and execute
them with \\[org-ctrl-c-ctrl-c] to receive ASSISTANT responses.

Key bindings:
  \\[org-ctrl-c-ctrl-c] - Execute PROMPT block at point

Usage:
  1. Create a #+begin_prompt block with your question
  2. Position cursor inside the block
  3. Press \\[org-ctrl-c-ctrl-c]
  4. Wait for the LLM to respond
  5. The response appears in a #+begin_assistant block below

All content before the prompt is sent as context, enabling
context-aware conversations about your document."
  :lighter " AI"
  :group 'org-dialog-eng
  (if org-dialog-eng-mode
      (org-dialog-eng--setup)
    (org-dialog-eng--teardown)))
#+end_src

The =:lighter= appears in the mode line. We use a short " AI" to avoid
cluttering the mode line.

** Setup and Teardown

#+begin_src emacs-lisp :noweb-ref mode-definition
(defun org-dialog-eng--setup ()
  "Set up org-dialog-eng-mode in the current buffer.
Adds hooks and font-lock keywords."
  ;; Hook into C-c C-c
  (add-hook 'org-ctrl-c-ctrl-c-hook #'org-dialog-eng--execute-block nil t)

  ;; Enable syntax highlighting
  (org-dialog-eng--setup-font-lock)

  ;; Refresh font-lock to apply immediately
  (when (fboundp 'font-lock-flush)
    (font-lock-flush)))

(defun org-dialog-eng--teardown ()
  "Clean up org-dialog-eng-mode in the current buffer.
Removes hooks and font-lock keywords."
  ;; Remove our C-c C-c hook
  (remove-hook 'org-ctrl-c-ctrl-c-hook #'org-dialog-eng--execute-block t)

  ;; Remove syntax highlighting
  (org-dialog-eng--teardown-font-lock)

  ;; Refresh font-lock
  (when (fboundp 'font-lock-flush)
    (font-lock-flush)))
#+end_src

*Design Decision*: We use buffer-local hooks (the =t= argument to
=add-hook=) so enabling the mode in one buffer doesn't affect others.

** Package Provide

#+begin_src emacs-lisp :noweb-ref provide
(provide 'org-dialog-eng)
#+end_src

* Testing

** Testing Philosophy

Testing an Emacs mode that interacts with external processes presents
unique challenges. We mock the subprocess to avoid dependencies on
actual LLM tools during tests.

