org-dialog-eng.html
<div id="outline-container-orgc341926" class="outline-3">
<h3 id="orgc341926"><span class="section-number-3">14.1.</span> The Execute Hook</h3>
<div class="outline-text-3" id="text-14-1">
<p>
Users expect <code>C-c C-c</code> in Org mode to "do something appropriate" with
the element at point. We hook into Org's existing mechanism:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun org-dialog-eng--execute-block ()
  "Hook function for `org-ctrl-c-ctrl-c-hook'.
Executes PROMPT blocks when point is inside one.
Returns non-nil if the block was executed, nil otherwise."
  (let* ((element (org-element-at-point))
         (block (org-element-lineage element '(special-block) t)))
    (when (and block (org-dialog-eng--element-is-prompt-block-p block))
      (org-dialog-eng--execute-prompt-block)
      t)))  ; Return t to stop hook processing
</pre>
</div>

<p>
By returning <code>t</code> when we handle the block, we prevent other
<code>org-ctrl-c-ctrl-c-hook</code> functions from running, avoiding conflicts.
</p>
</div>
</div>
<div id="outline-container-orgebcb75b" class="outline-3">
<h3 id="orgebcb75b"><span class="section-number-3">14.2.</span> Font Lock Integration</h3>
<div class="outline-text-3" id="text-14-2">
<p>
We register our custom faces with Emacs' font-lock system so blocks
are colored appropriately:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun org-dialog-eng--fontify-block (limit)
  "Fontify PROMPT and ASSISTANT blocks up to LIMIT.
This is a font-lock matcher function that properly handles multiline blocks."
  (let ((case-fold-search t))
    (when (re-search-forward
           "^[ \t]*#\\+begin_\\(prompt\\|assistant\\)\\&gt;"
           limit t)
      (let* ((block-type (match-string 1))
             (face (if (string-equal (downcase block-type) "prompt")
                       'org-dialog-eng-prompt-block
                     'org-dialog-eng-assistant-block))
             (beg (match-beginning 0))
             (end-re (format "^[ \t]*#\\+end_%s\\&gt;" block-type)))
        (when (re-search-forward end-re limit t)
          (let ((end (match-end 0)))
            (put-text-property beg end 'face face)
            (put-text-property beg end 'font-lock-multiline t)
            (goto-char end)
            t))))))

(defun org-dialog-eng--setup-font-lock ()
  "Add font-lock keywords for PROMPT and ASSISTANT blocks."
  ;; Use a function-based matcher for reliable multiline matching
  (font-lock-add-keywords nil
    '((org-dialog-eng--fontify-block))
    'append)
  ;; Enable multiline font-lock
  (setq-local font-lock-multiline t))

(defun org-dialog-eng--teardown-font-lock ()
  "Remove font-lock keywords for PROMPT and ASSISTANT blocks."
  (font-lock-remove-keywords nil
    '((org-dialog-eng--fontify-block))))
</pre>
</div>

<p>
<b>Implementation Note</b>: Instead of using complex multiline regexes
(which have limitations in Emacs font-lock), we use a <b><b>function-based
font-lock matcher</b></b>. The <code>org-dialog-eng--fontify-block</code> function
searches for begin markers, finds the corresponding end marker, and
applies the face to the entire region. This approach is more reliable
for multiline blocks and properly sets the <code>font-lock-multiline</code>
property to ensure refontification when blocks are edited.
</p>
</div>
</div>
</div>
<div id="outline-container-org4e8d6aa" class="outline-2">
<h2 id="org4e8d6aa"><span class="section-number-2">15.</span> Mode Definition and Lifecycle</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-orgfa16aac" class="outline-3">
<h3 id="orgfa16aac"><span class="section-number-3">15.1.</span> The Minor Mode</h3>
<div class="outline-text-3" id="text-15-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;;;###autoload
(define-minor-mode org-dialog-eng-mode
  "Minor mode for LLM integration in Org mode documents.

This mode enables interactive dialogues with Large Language Models
directly within your Org documents. Create PROMPT blocks and execute
them with \\[org-ctrl-c-ctrl-c] to receive ASSISTANT responses.

Key bindings:
  \\[org-ctrl-c-ctrl-c] - Execute PROMPT block at point

Usage:
  1. Create a #+begin_prompt block with your question
  2. Position cursor inside the block
  3. Press \\[org-ctrl-c-ctrl-c]
  4. Wait for the LLM to respond
  5. The response appears in a #+begin_assistant block below

All content before the prompt is sent as context, enabling
context-aware conversations about your document."
  :lighter " AI"
  :group 'org-dialog-eng
  (if org-dialog-eng-mode
      (org-dialog-eng--setup)
    (org-dialog-eng--teardown)))
</pre>
</div>

<p>
The <code>:lighter</code> appears in the mode line. We use a short " AI" to avoid
cluttering the mode line.
</p>
</div>
</div>
<div id="outline-container-orgc204bc2" class="outline-3">
<h3 id="orgc204bc2"><span class="section-number-3">15.2.</span> Setup and Teardown</h3>
<div class="outline-text-3" id="text-15-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun org-dialog-eng--setup ()
  "Set up org-dialog-eng-mode in the current buffer.
Adds hooks and font-lock keywords."
  ;; Hook into C-c C-c
  (add-hook 'org-ctrl-c-ctrl-c-hook #'org-dialog-eng--execute-block nil t)

  ;; Enable syntax highlighting
  (org-dialog-eng--setup-font-lock)

  ;; Refresh font-lock to apply immediately
  (when (fboundp 'font-lock-flush)
    (font-lock-flush)))

(defun org-dialog-eng--teardown ()
  "Clean up org-dialog-eng-mode in the current buffer.
Removes hooks and font-lock keywords."
  ;; Remove our C-c C-c hook
  (remove-hook 'org-ctrl-c-ctrl-c-hook #'org-dialog-eng--execute-block t)

  ;; Remove syntax highlighting
  (org-dialog-eng--teardown-font-lock)

  ;; Refresh font-lock
  (when (fboundp 'font-lock-flush)
    (font-lock-flush)))
</pre>
</div>

<p>
<b>Design Decision</b>: We use buffer-local hooks (the <code>t</code> argument to
<code>add-hook</code>) so enabling the mode in one buffer doesn't affect others.
</p>
</div>
</div>
<div id="outline-container-org7e678eb" class="outline-3">
<h3 id="org7e678eb"><span class="section-number-3">15.3.</span> Package Provide</h3>
<div class="outline-text-3" id="text-15-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(provide 'org-dialog-eng)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org45f67f8" class="outline-2">
<h2 id="org45f67f8"><span class="section-number-2">16.</span> Testing</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org2fc32ff" class="outline-3">
<h3 id="org2fc32ff"><span class="section-number-3">16.1.</span> Testing Philosophy</h3>
<div class="outline-text-3" id="text-16-1">
<p>
Testing an Emacs mode that interacts with external processes presents
unique challenges. We mock the subprocess to avoid dependencies on
actual LLM tools during tests.
</p>
</div>
</div>
