org-dialog-eng.el
  "Hook function for `org-ctrl-c-ctrl-c-hook'.
Executes PROMPT blocks when point is inside one.
Returns non-nil if the block was executed, nil otherwise."
  (let* ((element (org-element-at-point))
         (block (org-element-lineage element '(special-block) t)))
    (when (and block (org-dialog-eng--element-is-prompt-block-p block))
      (org-dialog-eng--execute-prompt-block)
      t)))  ; Return t to stop hook processing

(defun org-dialog-eng--fontify-block (limit)
  "Fontify PROMPT and ASSISTANT blocks up to LIMIT.
This is a font-lock matcher function that properly handles multiline blocks."
  (let ((case-fold-search t))
    (when (re-search-forward
           "^[ \t]*#\\+begin_\\(prompt\\|assistant\\)\\>"
           limit t)
      (let* ((block-type (match-string 1))
             (face (if (string-equal (downcase block-type) "prompt")
                       'org-dialog-eng-prompt-block
                     'org-dialog-eng-assistant-block))
             (beg (match-beginning 0))
             (end-re (format "^[ \t]*#\\+end_%s\\>" block-type)))
        (when (re-search-forward end-re limit t)
          (let ((end (match-end 0)))
            (put-text-property beg end 'face face)
            (put-text-property beg end 'font-lock-multiline t)
            (goto-char end)
            t))))))

(defun org-dialog-eng--setup-font-lock ()
  "Add font-lock keywords for PROMPT and ASSISTANT blocks."
  ;; Use a function-based matcher for reliable multiline matching
  (font-lock-add-keywords nil
    '((org-dialog-eng--fontify-block))
    'append)
  ;; Enable multiline font-lock
  (setq-local font-lock-multiline t))

(defun org-dialog-eng--teardown-font-lock ()
  "Remove font-lock keywords for PROMPT and ASSISTANT blocks."
  (font-lock-remove-keywords nil
    '((org-dialog-eng--fontify-block))))
;;;###autoload
(define-minor-mode org-dialog-eng-mode
  "Minor mode for LLM integration in Org mode documents.

This mode enables interactive dialogues with Large Language Models
directly within your Org documents. Create PROMPT blocks and execute
them with \\[org-ctrl-c-ctrl-c] to receive ASSISTANT responses.

Key bindings:
  \\[org-ctrl-c-ctrl-c] - Execute PROMPT block at point

Usage:
  1. Create a #+begin_prompt block with your question
  2. Position cursor inside the block
  3. Press \\[org-ctrl-c-ctrl-c]
  4. Wait for the LLM to respond
  5. The response appears in a #+begin_assistant block below

All content before the prompt is sent as context, enabling
context-aware conversations about your document."
  :lighter " AI"
  :group 'org-dialog-eng
  (if org-dialog-eng-mode
      (org-dialog-eng--setup)
    (org-dialog-eng--teardown)))
(defun org-dialog-eng--setup ()
  "Set up org-dialog-eng-mode in the current buffer.
Adds hooks and font-lock keywords."
  ;; Hook into C-c C-c
  (add-hook 'org-ctrl-c-ctrl-c-hook #'org-dialog-eng--execute-block nil t)

  ;; Enable syntax highlighting
  (org-dialog-eng--setup-font-lock)

  ;; Refresh font-lock to apply immediately
  (when (fboundp 'font-lock-flush)
    (font-lock-flush)))

(defun org-dialog-eng--teardown ()
  "Clean up org-dialog-eng-mode in the current buffer.
Removes hooks and font-lock keywords."
  ;; Remove our C-c C-c hook
  (remove-hook 'org-ctrl-c-ctrl-c-hook #'org-dialog-eng--execute-block t)

  ;; Remove syntax highlighting
  (org-dialog-eng--teardown-font-lock)

  ;; Refresh font-lock
  (when (fboundp 'font-lock-flush)
    (font-lock-flush)))

(provide 'org-dialog-eng)

;;; org-dialog-eng.el ends here
