org-dialog-eng.org
** The Placeholder Replacement Test

This test verifies the core interaction: a PROMPT is executed, a placeholder appears, then the actual response replaces it.

#+begin_src emacs-lisp :tangle org-dialog-eng-test.el
(require 'ert)
(require 'org-dialog-eng)

(ert-deftest org-dialog-eng-test-placeholder-replacement ()
  "Test that placeholder ASSISTANT block is replaced with LLM response.

This test mocks the LLM subprocess to verify that:
1. A placeholder ASSISTANT block appears immediately
2. The placeholder is replaced (not duplicated) when response arrives
3. The actual response content is correctly inserted"
  (with-temp-buffer
    (org-mode)
    (org-dialog-eng-mode 1)

    ;; Insert a PROMPT block
    (insert "#+begin_prompt\nTest prompt\n#+end_prompt\n")
    (goto-char (point-min))
    (forward-line 1)  ; Move inside the block

    ;; Mock the LLM executable to return a known response
    (cl-letf (((symbol-function 'make-process)
               (lambda (&rest args)
                 (let ((sentinel (plist-get args :sentinel))
                       (buffer (plist-get args :buffer)))
                   ;; Write mock response to output buffer
                   (with-current-buffer buffer
                     (insert "Test response from LLM"))
                   ;; Create a mock process
                   (let ((proc (make-pipe-process
                                :name "mock-process"
                                :buffer buffer)))
                     ;; Immediately call sentinel with finished status
                     (run-at-time 0.1 nil sentinel proc "finished\n")
                     proc)))))

      ;; Execute the prompt block
      (org-dialog-eng--execute-prompt-block)

      ;; Wait for async completion
      (sleep-for 0.2)

      ;; Verify results
      (goto-char (point-min))
      (should (search-forward "#+begin_assistant" nil t))
      (should-not (search-forward "LLM is working..." nil t))
      (goto-char (point-min))
      (should (search-forward "Test response from LLM" nil t)))))

(ert-deftest org-dialog-eng-test-element-detection ()
  "Test that PROMPT and ASSISTANT blocks are correctly identified."
  (with-temp-buffer
    (org-mode)
    (insert "#+begin_prompt\nTest\n#+end_prompt\n")
    (goto-char (point-min))
    (forward-line 1)
    (let ((element (org-element-at-point)))
      (should (org-dialog-eng--element-is-prompt-block-p
               (org-element-lineage element '(special-block) t))))

    (goto-char (point-max))
    (insert "\n#+begin_assistant\nResponse\n#+end_assistant\n")
    (forward-line -2)
    (let ((element (org-element-at-point)))
      (should (org-dialog-eng--element-is-assistant-block-p
               (org-element-lineage element '(special-block) t))))))

(ert-deftest org-dialog-eng-test-context-extraction ()
  "Test that preceding context is correctly extracted."
  (with-temp-buffer
    (org-mode)
    (insert "* Heading\nSome context here\n\n")
    (insert "#+begin_prompt\nQuestion\n#+end_prompt\n")
    (goto-char (point-min))
    (search-forward "Question")
    (let ((context (org-dialog-eng--get-preceding-context)))
      (should (string-match-p "Heading" context))
      (should (string-match-p "Some context here" context))
      (should-not (string-match-p "Question" context)))))
#+end_src

** Running Tests

Execute tests from the command line:

#+begin_src sh :eval never
emacs --batch -l ert -l org-dialog-eng.el -l org-dialog-eng-test.el \
      -f ert-run-tests-batch-and-exit
#+end_src

Or interactively within Emacs:

#+begin_src emacs-lisp :eval never
M-x load-file RET org-dialog-eng.el RET
M-x load-file RET org-dialog-eng-test.el RET
M-x ert RET t RET
#+end_src

* Usage and Integration Examples

** Basic Setup

Add to your =init.el= or =.emacs=:

#+begin_src emacs-lisp :eval never
(require 'org-dialog-eng)

;; Enable in all Org buffers (optional)
(add-hook 'org-mode-hook #'org-dialog-eng-mode)

;; Or enable manually with: M-x org-dialog-eng-mode
#+end_src

** Integration with Claude CLI

#+begin_src emacs-lisp :eval never
(setq org-dialog-eng-executable "claude")
#+end_src

Ensure the =claude= CLI tool is installed and in your PATH.

** Integration with GitHub Copilot CLI

#+begin_src emacs-lisp :eval never
(setq org-dialog-eng-executable "copilot")
#+end_src

** Custom Wrapper Example

For more control, create a wrapper script:

#+begin_src sh :eval never :tangle no
#!/bin/bash
# my-llm-wrapper: Custom LLM integration
# Handles authentication, logging, or formatting

PROMPT="$1"

# Log prompts for debugging
echo "$PROMPT" >> ~/.llm-prompts.log

# Call your LLM service
curl -s https://api.example.com/llm \
  -H "Authorization: Bearer $API_KEY" \
  -d "{\"prompt\": \"$PROMPT\"}" \
  | jq -r '.response'
#+end_src

Then configure:

#+begin_src emacs-lisp :eval never
(setq org-dialog-eng-executable "~/bin/my-llm-wrapper")
#+end_src

