org-dialog-eng.html
<div id="outline-container-orgcb68904" class="outline-3">
<h3 id="orgcb68904"><span class="section-number-3">16.2.</span> The Placeholder Replacement Test</h3>
<div class="outline-text-3" id="text-16-2">
<p>
This test verifies the core interaction: a PROMPT is executed, a placeholder appears, then the actual response replaces it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'ert)
(require 'org-dialog-eng)

(ert-deftest org-dialog-eng-test-placeholder-replacement ()
  "Test that placeholder ASSISTANT block is replaced with LLM response.

This test mocks the LLM subprocess to verify that:
1. A placeholder ASSISTANT block appears immediately
2. The placeholder is replaced (not duplicated) when response arrives
3. The actual response content is correctly inserted"
  (with-temp-buffer
    (org-mode)
    (org-dialog-eng-mode 1)

    ;; Insert a PROMPT block
    (insert "#+begin_prompt\nTest prompt\n#+end_prompt\n")
    (goto-char (point-min))
    (forward-line 1)  ; Move inside the block

    ;; Mock the LLM executable to return a known response
    (cl-letf (((symbol-function 'make-process)
               (lambda (&amp;rest args)
                 (let ((sentinel (plist-get args :sentinel))
                       (buffer (plist-get args :buffer)))
                   ;; Write mock response to output buffer
                   (with-current-buffer buffer
                     (insert "Test response from LLM"))
                   ;; Create a mock process
                   (let ((proc (make-pipe-process
                                :name "mock-process"
                                :buffer buffer)))
                     ;; Immediately call sentinel with finished status
                     (run-at-time 0.1 nil sentinel proc "finished\n")
                     proc)))))

      ;; Execute the prompt block
      (org-dialog-eng--execute-prompt-block)

      ;; Wait for async completion
      (sleep-for 0.2)

      ;; Verify results
      (goto-char (point-min))
      (should (search-forward "#+begin_assistant" nil t))
      (should-not (search-forward "LLM is working..." nil t))
      (goto-char (point-min))
      (should (search-forward "Test response from LLM" nil t)))))

(ert-deftest org-dialog-eng-test-element-detection ()
  "Test that PROMPT and ASSISTANT blocks are correctly identified."
  (with-temp-buffer
    (org-mode)
    (insert "#+begin_prompt\nTest\n#+end_prompt\n")
    (goto-char (point-min))
    (forward-line 1)
    (let ((element (org-element-at-point)))
      (should (org-dialog-eng--element-is-prompt-block-p
               (org-element-lineage element '(special-block) t))))

    (goto-char (point-max))
    (insert "\n#+begin_assistant\nResponse\n#+end_assistant\n")
    (forward-line -2)
    (let ((element (org-element-at-point)))
      (should (org-dialog-eng--element-is-assistant-block-p
               (org-element-lineage element '(special-block) t))))))

(ert-deftest org-dialog-eng-test-context-extraction ()
  "Test that preceding context is correctly extracted."
  (with-temp-buffer
    (org-mode)
    (insert "* Heading\nSome context here\n\n")
    (insert "#+begin_prompt\nQuestion\n#+end_prompt\n")
    (goto-char (point-min))
    (search-forward "Question")
    (let ((context (org-dialog-eng--get-preceding-context)))
      (should (string-match-p "Heading" context))
      (should (string-match-p "Some context here" context))
      (should-not (string-match-p "Question" context)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3b41def" class="outline-3">
<h3 id="org3b41def"><span class="section-number-3">16.3.</span> Running Tests</h3>
<div class="outline-text-3" id="text-16-3">
<p>
Execute tests from the command line:
</p>

<div class="org-src-container">
<pre class="src src-sh">emacs --batch -l ert -l org-dialog-eng.el -l org-dialog-eng-test.el \
      -f ert-run-tests-batch-and-exit
</pre>
</div>

<p>
Or interactively within Emacs:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">M-x load-file RET org-dialog-eng.el RET
M-x load-file RET org-dialog-eng-test.el RET
M-x ert RET t RET
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7de6d8d" class="outline-2">
<h2 id="org7de6d8d"><span class="section-number-2">17.</span> Usage and Integration Examples</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-orgdaf6ff4" class="outline-3">
<h3 id="orgdaf6ff4"><span class="section-number-3">17.1.</span> Basic Setup</h3>
<div class="outline-text-3" id="text-17-1">
<p>
Add to your <code>init.el</code> or <code>.emacs</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'org-dialog-eng)

;; Enable in all Org buffers (optional)
(add-hook 'org-mode-hook #'org-dialog-eng-mode)

;; Or enable manually with: M-x org-dialog-eng-mode
</pre>
</div>
</div>
</div>
<div id="outline-container-org8a4df71" class="outline-3">
<h3 id="org8a4df71"><span class="section-number-3">17.2.</span> Integration with Claude CLI</h3>
<div class="outline-text-3" id="text-17-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq org-dialog-eng-executable "claude")
</pre>
</div>

<p>
Ensure the <code>claude</code> CLI tool is installed and in your PATH.
</p>
</div>
</div>
<div id="outline-container-org55ed5d5" class="outline-3">
<h3 id="org55ed5d5"><span class="section-number-3">17.3.</span> Integration with GitHub Copilot CLI</h3>
<div class="outline-text-3" id="text-17-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq org-dialog-eng-executable "copilot")
</pre>
</div>
</div>
</div>
<div id="outline-container-org02583b5" class="outline-3">
<h3 id="org02583b5"><span class="section-number-3">17.4.</span> Custom Wrapper Example</h3>
<div class="outline-text-3" id="text-17-4">
<p>
For more control, create a wrapper script:
</p>

<div class="org-src-container">
<pre class="src src-sh">#!/bin/bash
# my-llm-wrapper: Custom LLM integration
# Handles authentication, logging, or formatting

PROMPT="$1"

# Log prompts for debugging
echo "$PROMPT" &gt;&gt; ~/.llm-prompts.log

# Call your LLM service
curl -s https://api.example.com/llm \
  -H "Authorization: Bearer $API_KEY" \
  -d "{\"prompt\": \"$PROMPT\"}" \
  | jq -r '.response'
</pre>
</div>

<p>
Then configure:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq org-dialog-eng-executable "~/bin/my-llm-wrapper")
</pre>
</div>
</div>
</div>
