org-dialog-eng.org
** Example Workflow
I'm building a web scraper in Python that needs to handle rate limiting.

#+begin_prompt
What's the best approach for implementing exponential backoff in a Python web scraper?
#+end_prompt

2. Press =C-c C-c= inside the prompt block

3. The response appears automatically:

#+begin_assistant
For Python web scrapers, I recommend the `tenacity` library for exponential backoff:

#+begin_src python
from tenacity import retry, wait_exponential, stop_after_attempt
import requests

@retry(wait=wait_exponential(multiplier=1, min=4, max=10),
       stop=stop_after_attempt(5))
def fetch_url(url):
    response = requests.get(url)
    response.raise_for_status()
    return response.text
#+end_src

This provides automatic retries with exponential backoff between 4-10 seconds.
#+end_assistant

4. Continue the conversation by adding another prompt that references the previous response.

* Future Directions

** Potential Enhancements

- *Streaming responses*: Display the LLM's output as it generates, rather than waiting for completion
- *Multi-turn refinement*: Add a "refine response" command that sends the ASSISTANT block back for improvement
- *Named conversations*: Support multiple independent conversation threads in one document
- *Export filtering*: Options to exclude PROMPT/ASSISTANT blocks from exports
- *Token counting*: Display estimated token usage before sending prompts
- *History management*: Commands to clear old responses or prune context

** Architectural Extensibility

The subprocess-based design makes many extensions possible without core changes:

- Use different LLMs for different prompts (via block parameters)
- Implement caching layers in wrapper scripts
- Add retry logic or fallback providers
- Integrate with org-babel for executable code responses

** Contributing

This literate program is designed for collaborative improvement. To contribute:

1. Propose changes to the narrative or code
2. Ensure the document remains readable linearly
3. Add tests for new functionality
4. Keep the design philosophy intact: simplicity and transparency

* Conclusion

We have built a mode that extends literate programming into the era of
AI assistance. The implementation is straightforward—under 400 lines
of Emacs Lisp—yet powerful enough to transform how we write technical
documents.

The key insight is that documents can be living conversations, where
human and AI thoughts interleave naturally. As you write, you can ask
questions, request examples, or seek clarifications, and the answers
become part of the permanent record.

This is literate programming for the age of AI: not just explaining
code to humans, but collaborating with AI to create better
explanations, code, and ideas.

* Colophon

This document was written in Org mode using =org-dialog-eng-mode=
itself. Many of the design decisions and code improvements emerged
from conversations embedded in earlier drafts—a form of dogfooding
that validated the core concept.

The noweb-style literate programming approach, pioneered by Norman
Ramsey building on Donald Knuth's WEB system, proves remarkably
well-suited to modern Emacs development. The ability to present code
in human-logical order while tangling it into machine-logical order
remains as valuable today as when Knuth first proposed it in 1984.

#+begin_example
"Let us change our traditional attitude to the construction of programs:
Instead of imagining that our main task is to instruct a computer what to do,
let us concentrate rather on explaining to human beings what we want a
computer to do."
                                                    — Donald Knuth (1984)
#+end_example

To this, we might now add: and let us invite AI assistants to help us
in that explanation.

#+begin_src emacs-lisp :eval never
;; End of org-dialog-eng literate program
#+end_src

