org-dialog-eng.html
<div id="outline-container-orgfaded5b" class="outline-3">
<h3 id="orgfaded5b"><span class="section-number-3">17.5.</span> Example Workflow</h3>
<div class="outline-text-3" id="text-17-5">
<p>
I'm building a web scraper in Python that needs to handle rate limiting.
</p>

<div class="prompt" id="org9894ec0">
<p>
What's the best approach for implementing exponential backoff in a Python web scraper?
</p>

</div>

<ol class="org-ol">
<li>Press <code>C-c C-c</code> inside the prompt block</li>

<li>The response appears automatically:</li>
</ol>

<div class="assistant" id="org5820287">
<p>
For Python web scrapers, I recommend the `tenacity` library for exponential backoff:
</p>

<div class="org-src-container">
<pre class="src src-python">from tenacity import retry, wait_exponential, stop_after_attempt
import requests

@retry(wait=wait_exponential(multiplier=1, min=4, max=10),
       stop=stop_after_attempt(5))
def fetch_url(url):
    response = requests.get(url)
    response.raise_for_status()
    return response.text
</pre>
</div>

<p>
This provides automatic retries with exponential backoff between 4-10 seconds.
</p>

</div>

<ol class="org-ol">
<li>Continue the conversation by adding another prompt that references the previous response.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org91d4b3d" class="outline-2">
<h2 id="org91d4b3d"><span class="section-number-2">18.</span> Future Directions</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-org0c27e06" class="outline-3">
<h3 id="org0c27e06"><span class="section-number-3">18.1.</span> Potential Enhancements</h3>
<div class="outline-text-3" id="text-18-1">
<ul class="org-ul">
<li><b>Streaming responses</b>: Display the LLM's output as it generates, rather than waiting for completion</li>
<li><b>Multi-turn refinement</b>: Add a "refine response" command that sends the ASSISTANT block back for improvement</li>
<li><b>Named conversations</b>: Support multiple independent conversation threads in one document</li>
<li><b>Export filtering</b>: Options to exclude PROMPT/ASSISTANT blocks from exports</li>
<li><b>Token counting</b>: Display estimated token usage before sending prompts</li>
<li><b>History management</b>: Commands to clear old responses or prune context</li>
</ul>
</div>
</div>
<div id="outline-container-org25527d4" class="outline-3">
<h3 id="org25527d4"><span class="section-number-3">18.2.</span> Architectural Extensibility</h3>
<div class="outline-text-3" id="text-18-2">
<p>
The subprocess-based design makes many extensions possible without core changes:
</p>

<ul class="org-ul">
<li>Use different LLMs for different prompts (via block parameters)</li>
<li>Implement caching layers in wrapper scripts</li>
<li>Add retry logic or fallback providers</li>
<li>Integrate with org-babel for executable code responses</li>
</ul>
</div>
</div>
<div id="outline-container-org24461ab" class="outline-3">
<h3 id="org24461ab"><span class="section-number-3">18.3.</span> Contributing</h3>
<div class="outline-text-3" id="text-18-3">
<p>
This literate program is designed for collaborative improvement. To contribute:
</p>

<ol class="org-ol">
<li>Propose changes to the narrative or code</li>
<li>Ensure the document remains readable linearly</li>
<li>Add tests for new functionality</li>
<li>Keep the design philosophy intact: simplicity and transparency</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgfa4c047" class="outline-2">
<h2 id="orgfa4c047"><span class="section-number-2">19.</span> Conclusion</h2>
<div class="outline-text-2" id="text-19">
<p>
We have built a mode that extends literate programming into the era of
AI assistance. The implementation is straightforward—under 400 lines
of Emacs Lisp—yet powerful enough to transform how we write technical
documents.
</p>

<p>
The key insight is that documents can be living conversations, where
human and AI thoughts interleave naturally. As you write, you can ask
questions, request examples, or seek clarifications, and the answers
become part of the permanent record.
</p>

<p>
This is literate programming for the age of AI: not just explaining
code to humans, but collaborating with AI to create better
explanations, code, and ideas.
</p>
</div>
</div>
<div id="outline-container-orge0ff94c" class="outline-2">
<h2 id="orge0ff94c"><span class="section-number-2">20.</span> Colophon</h2>
<div class="outline-text-2" id="text-20">
<p>
This document was written in Org mode using <code>org-dialog-eng-mode</code>
itself. Many of the design decisions and code improvements emerged
from conversations embedded in earlier drafts—a form of dogfooding
that validated the core concept.
</p>

<p>
The noweb-style literate programming approach, pioneered by Norman
Ramsey building on Donald Knuth's WEB system, proves remarkably
well-suited to modern Emacs development. The ability to present code
in human-logical order while tangling it into machine-logical order
remains as valuable today as when Knuth first proposed it in 1984.
</p>

<pre class="example" id="orge317621">
"Let us change our traditional attitude to the construction of programs:
Instead of imagining that our main task is to instruct a computer what to do,
let us concentrate rather on explaining to human beings what we want a
computer to do."
                                                    — Donald Knuth (1984)
</pre>

<p>
To this, we might now add: and let us invite AI assistants to help us
in that explanation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;; End of org-dialog-eng literate program
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025</p>
<p class="author">Author: Pablo Munoz</p>
<p class="date">Created: 2025-11-02 Sun 23:23</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
